{"data":{"site":{"siteMetadata":{"title":"Sean's Blog","author":"Sean Lynch"}},"markdownRemark":{"id":"c9345f10-d12d-556e-a563-d4de307d57f6","html":"<p>I finally got around to updating the website to the MVC preview 2, and ran into a couple of things. </p>\n<ol>\n<li>\n<p>TagBuilder being internal. While the implementation of it CreateInputTag, CreateTag and CreateAttributeList. The removal of .ToAttributeList() was actually what made me go looking for this. The HtmlExtensionUtility extension methods would have been nice to have also.\nI guess a better way to say it is it would be nice not to have to reimplement the functionality that CreateAttributeList and ConvertObjectToAttributeList already implement.</li> </p>\n<ul>\n<li>\n<p>It would be nice if SimpleForm inherited from a class, that could be subclassed to make Div and Span tags that have attributes based on routing information.\nAdmittedly it is a rather simple to implement what I am <a href=\"http://myheadsexploding.com/archive/2007/12/16/generic-beginend-html-tag-extension-method.aspx\" target=\"_blank\">talking about</a> but I think it would be nice to have already there.</li> </ol> </p>\n<p>I’m still rummaging through the routing stuff, so don’t have to much input on those it at the moment. But it looks like I will be able to take all the category discovery information out of my controllers, and just have it passed into the action, which will be nice.</p>\n<p>On a side note, after looking at the classes that were made into base classes. I cant really say that I would ever have a need for them to be interfaces. As I can’t think of any other class I would want to tack their functionality onto, after all interfaces were the answer to not having multiple inheritance (I still wish I had it multi-inheritance though). </p>\n<p>I do however hope that IRouteHandler stays an interface though, because I can see myself taking that behavior onto an object. Just not sure where.</p>\n<div class=\"wlWriterSmartContent\" id=\"scid:0767317B-992E-4b12-91E0-4F059A8CECA8:193f68ef-805b-422a-b3a5-7bd6f427bf5f\" style=\"padding-right: 0px; display: inline; padding-left: 0px; float: none; padding-bottom: 0px; margin: 0px; padding-top: 0px\">\n  Technorati Tags: <a href=\"http://technorati.com/tags/aspnetmvc\" rel=\"tag\">aspnetmvc</a>\n</div>\n<img src=\"http://seanlynch.io/aggbug/54.aspx\" width=\"1\" height=\"1\">\n<p><span class=\"tve-leads-two-step-trigger tl-2step-trigger-0\"></span><span class=\"tve-leads-two-step-trigger tl-2step-trigger-0\"></span></p>\n</li>\n</ul>\n</li>\n</ol>","frontmatter":{"title":"A few simple MVC control suggestions","date":"March 18, 2008"}}},"pageContext":{"slug":"/a-few-simple-mvc-control-suggestions/","previous":{"fields":{"slug":"/anonymous-types-and-interfaces/"},"frontmatter":{"title":"Anonymous Types and Interfaces"}},"next":{"fields":{"slug":"/routing-revisited/"},"frontmatter":{"title":"Routing revisited"}}}}