{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"b4aff6d3-3be9-5adf-b10a-4c927eb5047e","html":"<p>I recently integrated OpenId into a project that I am working on with my wife, <a href=\"http://webquestbuilder.com/\">WebQuest Builder</a> in order to avoid the extra considerations related to storing user password.</p>\n<p>Originally I had planned on using RPXNow in order to do this. But after reading about how realms worked, specifically that  Google gives a different identifier for each realm, I decided against this option. Because</p>\n<p>while RPXNow does have support  for custom realms, webquestbuilder.com instead of webquestbuilder.rpxnow.com, it would cost $99/month in order to get this. And after my wife made a comment that it seemed almost like someone phishing for her account do to the webquestbuilder.rxpnow.com in Googles OpenId form.</p>\n<p>The other option that I had been considering had been <a href=\"http://www.dotnetopenauth.net/\">DotNetOpenAuth</a> which was very simple to integrate. It took about an hour to get it running in my development environment. I only had one issue when I pushed it live, which I will go into in a <a href=\"http://seanlynch.io/dotnetopenauth-with-appdirectory-removed/\" title=\"future post\">future post</a>. For the OpenId selector I used <a href=\"http://jvance.com/pages/JQueryOpenIDPlugin.xhtml\">Jarrett Vance’s Id selector</a> for the Sign In.</p>\n<p>After showing it to a few people I ended up making a few tweaks to the Id Selector. The first  chance that I made was to change it so that the OpenId checkbox did not show up, because a couple of the people I showed it to tried entering in their gmail address instead of Google’s OpenId Url. The other change I did was order them by which providers I thought they were most likely to be using, I hope the Microsoft gets their OpenId provider going soon so that I can integrate hotmail/live accounts into this.</p>\n<p><span class=\"tve-leads-two-step-trigger tl-2step-trigger-0\"></span><span class=\"tve-leads-two-step-trigger tl-2step-trigger-0\"></span></p>","frontmatter":{"title":"Open Id with DotNetOpenId","date":"March 02, 2010"}}},"pageContext":{"slug":"/2010-03-02-open-id-with-dotnetopenid/","previous":{"fields":{"slug":"/2008-07-07-scriptcontrol-question/"},"frontmatter":{"title":"ScriptControl question"}},"next":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}}}}